app/Controllers/LoginController.php

    private function authenticate($email, $password)
    {

        $userModel = new UserModel;
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'bosixe@mailinator.com'
 LIMIT 1

    private function getUserDetailsFromDatabase($email)
    {
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'bosixe@mailinator.com'
 LIMIT 1