app/Controllers/ProfileController.php

SELECT *
FROM `users`
WHERE `email` = 'bosixe@mailinator.com'
---
    public function index()
    {
        $userModel = new UserModel();
        $email = session()->get('email');

        if (!$email == '')
        {
        // print_r($email);die;
        $data['users'] = $userModel->where('email', $email)->findAll();