app/Controllers/ReferralController.php

    public function index()
    {
        $id = session()->get('user_id');


            if (!$id == '')
            {
            $userModel = new EnquiryModel();
            $segment = $this->request->uri->getSegment(1);

            // Pagination Config
            $config = [
                'baseURL' => base_url($segment . '/index'),
                'totalRows' => $userModel->where('user_id', $id)->countAllResults(),
                'per_page' => 9,
            ];

            $pager = \Config\Services::pager(null, null, false); // Initialize Pager

            // Initialize Pagination
            $userModel->where('user_id', $id);
            $data['user'] = $userModel->paginate(9);
---
SELECT COUNT(*) AS `numrows`
FROM `enquiries`
WHERE `user_id` = '334'
SELECT *
FROM `enquiries`
WHERE `user_id` = '334'
 LIMIT 9

    public function searchEnquiry_fun()
{
    $searchKeyword = $this->request->getGet('search_keyword');



    // Retrieve the current user's ID (assuming it's stored in the session)
    $currentUserId = session()->get('user_id');

    // Load the EnquiryModel
    $enquiryModel = new EnquiryModel();

    // Pagination Config
    $config = [
        'baseURL' => base_url('your_controller/searchEnquiry_fun'), // Update 'your_controller' with your actual controller name
        'totalRows' => $enquiryModel->where('user_id', $currentUserId)
                                     ->groupStart()
                                        ->like('patient_name', $searchKeyword)
                                        ->orLike('appointment_date', $searchKeyword)
                                     ->groupEnd()
                                     ->countAllResults(),
        'per_page' => 6,
    ];
---
SELECT *
FROM `enquiries`
WHERE `user_id` = '334'
AND   (
`patient_name` LIKE '%fgsdfg%' ESCAPE '!'
OR  `appointment_date` LIKE '%fgsdfg%' ESCAPE '!'
 )
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `enquiries`
WHERE `user_id` = '334'
AND   (
`patient_name` LIKE '%fgsdfg%' ESCAPE '!'
OR  `appointment_date` LIKE '%fgsdfg%' ESCAPE '!'
 )