app/Controllers/ReferController.php

INSERT INTO `enquiries` (`patient_name`, `date_of_birth`, `required_specialist`, `phone`, `appointment_date`, `note`, `referral_doctor`, `age`, `email`, `gender`, `address`, `hospital_id`, `user_id`) VALUES ('Lionel Sanchez', '1977-05-06', '2', '9152451458', '2009-06-22T23:38', 'Dignissimos dolores ', 'Bevis Hebert', '47', 'qyjamas@mailinator.com', 'Female', 'Autem beatae est sin', '334', '334')
---
                $data['hospital_id'] = $user_hospital;
            }
        }
        $result = $enquiryModel->insert($data);